interfaces/src/main/resources/templates/GeefFuncties/02.00.0000/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:web="http://webservice.geeffunctiesdienst-02_00.onderneming-02_00.vip.vlaanderen.be">
    <soapenv:Header/>
    <soapenv:Body>
        <web:GeefFuncties>
            <Verzoek>
                <Context>
                    <Naam>GeefFuncties</Naam>
                    <Versie>02.00.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>Datum</Datum>
                            <Tijd>Tijd</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>Identificatie</Identificatie>
                            <Referte>Referte</Referte>
                            <Hoedanigheid>Hoedanigheid</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>Referte</Referte>
                        <Inhoud>
                            <Criteria>
                                <Persoon>
                                    <INSZ>INSZ</INSZ>
                                    <Ondernemingsnummer>Ondernemingsnummer</Ondernemingsnummer>
                                </Persoon>
                                <AardFuncties>
                                    <AardFunctie>AardFunctie1</AardFunctie>
                                    <AardFunctie>AardFunctie2</AardFunctie>
                                </AardFuncties>
                            </Criteria>
                        </Inhoud>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </web:GeefFuncties>
    </soapenv:Body>
</soapenv:Envelope>